{
	"questionData": {
		"score": 2690,
		"author": "free__soul",
		"created_utc": 1559761356,
		"num_comments": 1414,
		"gildings": {},
		"title": "People who were the reasons for certain rules what is your story?",
		"id": "bx6fpf",
		"nsfw": false,
		"flair": {
			"text": null,
			"bgColor": ""
		}
	},
	"commentData": [
		{
			"score": 1939,
			"author": "Yserbius",
			"created_utc": 1559765192,
			"edited": false,
			"gildings": {},
			"body_html": "<p>Former co-workers of mine. Contracted employees have a maximum amount of time they can work each week.&nbsp;</p>\n<p>Company pushed a lot of 60+ year old employees into retirement via a benefits change. A bunch of those who retired re-signed on as contracted hourly workers and started making more money than they had before they retired.</p>",
			"id": "eq3xyr7",
			"replies": [
				{
					"score": 401,
					"author": "igotmyliverpierced",
					"created_utc": 1559791771,
					"edited": false,
					"gildings": {},
					"body_html": "<p>My dad did that. Retired with pension and full benefits after 35 years. Then they realized they still needed him and asked him to come back. He told them he would help them but only as a contractor at some absurd hourly rate and they had to keep paying his retirement benefits. They agreed because they needed to finish the project.and he doubled up for awhile. When he finally left again he still had his same benefits rolling (which was enough to retire comfortably on) but he also had made 6 figures (less taxes) working 25 hours a week in his one year as a contractor.</p>\n<p>Now they don't do contracting. They've brought a couple people back in similar fashion but as part time employees and the retirement benefits get put on hold.</p>",
					"id": "eq52w5o",
					"replies": []
				}
			]
		},
		{
			"score": 661,
			"author": "Amazingawesomator",
			"created_utc": 1559768872,
			"edited": false,
			"gildings": {},
			"body_html": "<p>Checking ID at work when we have parties that contain alcohol. Used to be honor system until a newly hired person under 21 drank too much and vomited in the hallway.</p>",
			"id": "eq447n3",
			"replies": [
				{
					"score": 344,
					"author": "kitty_logan",
					"created_utc": 1559780385,
					"edited": false,
					"gildings": {},
					"body_html": "<p>Our CFO’s 16 year old daughter worked for us for one summer and we did a booze cruise. She was doing shots on the boat with her department. Her dad didn’t even get mad when he had to practically carry her to a cab. Weird dynamic.</p>",
					"id": "eq4mt9q",
					"replies": []
				}
			]
		},
		{
			"score": 1387,
			"author": "iszy201",
			"created_utc": 1559764121,
			"edited": false,
			"gildings": {},
			"body_html": "<p>they banned doing handstands at my primary school because we used to play the game where you’d sing a song and go up into a handstand and when I went up, for some reason my arm just gave way and I landed on my shoulder and broke my collarbone, I saw my old teacher a few weeks ago and apparently that’s the handstand story equivalent of the boy who swung back on his chair and cracked his head open</p>",
			"id": "eq3w0c7",
			"replies": []
		},
		{
			"score": 1372,
			"author": "scrooplynooples",
			"created_utc": 1559773396,
			"edited": false,
			"gildings": {},
			"body_html": "<p>When I was going into 6th grade, my family was moving to a new town. In order to prevent myself and my brother from having to go through the hassle of moving and to alleviate some of their stress, my parents decided to send us to sleep away camp for 6 weeks.&nbsp;</p>\n<p>My brother, 2 years older, proceeded to get extremely sick within the first week or so that we were at camp. He was on bed rest and at more than one point the staff had to bring him into the small town nearby to go to the hospital.&nbsp;</p>\n<p>My mother had a tendency to overreact and make mountains out of molehills. She was extremely unhappy with the staff and thought it was outrageous that my brother got that sick that quickly, assuming that someone must have showed up to camp on the first day knowing they were sick and spread the germ to my brother.&nbsp;</p>\n<p>Luckily, he recovered after the first week and was able to enjoy the rest of the summer. When the term was over we left camp, excited to see our new house and meet the people at our new school.&nbsp;</p>\n<p>Fast forwarding to the next summer, our parents saw how much we enjoyed camp, and decided that having us out of the house for a month wasn’t so bad for themselves either. Instead of driving us this summer, they decided to send us on the buses the camp ran to different counties and states. The total ride was about 4 hours, an eternity for a middle schooler with a surplus of energy.&nbsp;</p>\n<p>Once we arrived at camp, the buses all line up and there’s an in-processing tent set up where all the kids had to walk through before they could get their bags and go to their cabins. It was taking forever. I started to get irritated; I had waited all year for this and now I have to wait more! I finally get off the bus and into the tent and see what they are doing. Each camper is getting asked a series of questions about their current health- are they feeling sick, so they have any allergies, do they have any prescriptions, etc. They would then get their temperature taken by the nurse to confirm they did not have a fever, and were sent with a counselor to their cabin.&nbsp;</p>\n<p>I get to the end of the line, and ask the nurse why they are doing all of this because it is taking so long and I was being an impatient child.&nbsp;</p>\n<p>Her response: “A parent was very upset last summer that their camper got sick, so now we are screening everyone and quarantine them if they show any signs or symptoms of being ill”</p>\n<p>I look at my brother, who was standing behind me, and yelled “THANKS A LOT”.</p>",
			"id": "eq4bhl5",
			"replies": []
		},
		{
			"score": 589,
			"author": "nobonkyourmom",
			"created_utc": 1559776058,
			"edited": false,
			"gildings": {},
			"body_html": "<p>In third grade I jumped off of a very tall piece of playground equipment, smacked my chin on my knee and bit my tongue. It was a blood bath and the teacher passed out and hit her head off of the pavement... resulting in another blood bath. Welp, the next morning there was an announcement stating no more jumping of off the \"tower\" on the playground. The next day the teachers son tried jumping off of a rope swing over the school yard fence and broke both of his arms. The school removed all of the fun stuff off of the playground that summer.</p>",
			"id": "eq4g0re",
			"replies": []
		},
		{
			"score": 1619,
			"author": "sable_xo",
			"created_utc": 1559761949,
			"edited": false,
			"gildings": {},
			"body_html": "<p>When i was younger (3 or 4) my school had a large field near the entrance where we'd walk across to get to class from our drop off room. I decided it would be funny to try and run away. My brother did the same thing a year later in the same year, and that's when they introduced a fun coloured rope everyone had to hold onto when going to and from classes</p>",
			"id": "eq3s3el",
			"replies": []
		},
		{
			"score": 479,
			"author": "A1hugx",
			"created_utc": 1559776425,
			"edited": false,
			"gildings": {},
			"body_html": "<p>At my school, it was a rule to not act like a ninja. When I was young, I got interested into Naruto so I started acting like a ninja. 3 people saw me and started to act like a ninja as well. The teacher noticed so she told us to stop. We stopped for the day but the next day, we did it again. Our teacher was getting annoyed so she gave us a bad star(a red star that meant you we bad. At the end of the week, you had to take the bad stars home for your parents to see) we got mad at the teacher so when she wasn’t looking, one of the ninjas stood up and walked slowly. He plopped the red stars from each of the ninjas star sheet. Teacher noticed and &nbsp;had enough. She sent us to the principals office. He was laughing but told us to stop. Next day, there was a rule. Don’t act like ninjas.</p>",
			"id": "eq4glop",
			"replies": []
		},
		{
			"score": 2951,
			"author": "cerealbro1",
			"created_utc": 1559761767,
			"edited": false,
			"gildings": {},
			"body_html": "<p>So, in my high school there is a rule that was added my junior year and is even in bold in the student/parent handbook. This rule was that students are not allowed off campus during the 10-minute passing period at all. The reason that this rule exists is that my sophomore year I was really craving a Starbucks during my first period so in the last few minutes of the period I mobile ordered a coffee and then during break ran half a mile to pick up my coffee and walk back. I made it back to my class on time, but the school still tried to get me in trouble until I said \"show me where it says I cant leave campus during the passing period in the handbook and I will accept any punishment, otherwise you have no grounds to punish me\" and after 20 minutes of sitting in the office I got out with no punishment. Then my junior year that rule was added to the handbook. To this day its one of my best (worst) accomplishments</p>",
			"id": "eq3rrqm",
			"replies": []
		},
		{
			"score": 417,
			"author": "PrettyFarAwayNow",
			"created_utc": 1559779172,
			"edited": false,
			"gildings": {},
			"body_html": "<p>My high school had a policy that any student who passed an A.P. exam with a score or 3 or above would receive an automatic 'A' in the corresponding class.&nbsp;</p>\n<p>I failed A.P. Government--I never did my homework--and got a 4 or 5 on the exam.&nbsp;</p>\n<p>They changed the policy the next year.</p>",
			"id": "eq4kyih",
			"replies": [
				{
					"score": 146,
					"author": "Linc3000",
					"created_utc": 1559794534,
					"edited": false,
					"gildings": {},
					"body_html": "<p>I was in debate with a guy who did this for like all of his AP classes. Super smart but Holy shit was he lazy.</p>",
					"id": "eq57nwq",
					"replies": []
				}
			]
		},
		{
			"score": 1029,
			"author": "RonSwansonsOldMan",
			"created_utc": 1559772794,
			"edited": false,
			"gildings": {},
			"body_html": "<p>I moved from the Midwest to Texas to attend college. &nbsp;It was the first the time I tasted deep fried okra. &nbsp;The cafeteria was all you could eat. &nbsp;The okra was like crack to me and I ate plateful after plateful. &nbsp;Pretty soon the rule was two servings per meal.</p>",
			"id": "eq4ags5",
			"replies": []
		},
		{
			"score": 186,
			"author": "user156427",
			"created_utc": 1559775992,
			"edited": false,
			"gildings": {},
			"body_html": "<p>my primary school had to ban human pyramids bc we would get like 12-16 people involved and we weren’t very good at making pyramids so our uniforms would constantly be covered in mud from us falling onto the grass, plus they were afraid we would crush each other</p>",
			"id": "eq4fx0w",
			"replies": []
		},
		{
			"score": 1265,
			"author": "AverageCartPusher",
			"created_utc": 1559768239,
			"edited": 1559827575,
			"gildings": {},
			"body_html": "<p>I got beyblades banned in 4th grade. Circa like 2002. My mom had cheaped out and bought me an off brand beyblade that was heavier and I think made out of metal or something dense.&nbsp;</p>\n<p>Anyways we had this one kid who would bring in the like battle dome or whatever they had. My beyblade would collide with theirs and theirs would just go flying out of the dome at unsuspecting victims.</p>",
			"id": "eq4353u",
			"replies": [
				{
					"score": 170,
					"author": "kg1206",
					"created_utc": 1559786932,
					"edited": false,
					"gildings": {},
					"body_html": "<p>Someone at my elementary school lost a finger to one of those metal beyblades because he tried to pick it up while it was still spinning which you can do quite easily with a normal one.</p>\n<p>Granted the thing didn’t completely take his finger off right away it just severed it enough that the hospital couldn’t effectively re attach it and just took it the rest of the way off. From what I heard the cut was similar to what a chainsaw would do, shred the flesh instead of cleanly cut it like a knife and that’s why they couldn’t do anything about it.</p>",
					"id": "eq4vint",
					"replies": []
				}
			]
		},
		{
			"score": 1165,
			"author": "HighBiAndReadyToDie",
			"created_utc": 1559762011,
			"edited": false,
			"gildings": {},
			"body_html": "<p>At school there's now a rule that nothing can be mass printed (even though we have a set amount of printing credit) because I blocked up the printer while printing tiled fat yoshi and fat skipper</p>",
			"id": "eq3s7gl",
			"replies": []
		},
		{
			"score": 678,
			"author": "theheartsanddaggers",
			"created_utc": 1559763647,
			"edited": false,
			"gildings": {},
			"body_html": "<p>Back in the day, on neopets, there was this rule that you couldn't make posts titled things like \"GiRlS oNlY PARTY!!\" but the rule was never enforced.</p>\n<p>So, one day, when I was 12 (and on my mother's neopets account, since I was too young to use the neoboards), I made one of these boards. &nbsp;And everything was fine for the first 10-15 pages. &nbsp;Everyone was staying within the rules on the rule-breaking post, so TNT (The Neopets Team, basically the mods and developers and stuff) left us alone. &nbsp;And then, someone decided to RP going swimming. &nbsp;Which was kinda risky and I warned against it. &nbsp;Shortly thereafter, someone made a post that was pretty similar to the following:</p>\n<pre><code>Oh, okay.<br>\n*gets out of water*<br>\n*bikini falls off*<br>\nOops.<br>\n</code></pre>\n<p>The board was instantly deleted, my mother's account was permanently frozen, and from that day forward, when someone used the word \"bikini\" on the neoboards, a filter changed the word to \"cardigan.\"</p>",
			"id": "eq3v5oi",
			"replies": []
		},
		{
			"score": 148,
			"author": "MC-NIGLET",
			"created_utc": 1559772620,
			"edited": 1559773084,
			"gildings": {},
			"body_html": "<p>“No tea on campus”</p>\n<p>Basically in like 7-8th grade I ran a chicken express sweet tea empire</p>",
			"id": "eq4a6ly",
			"replies": [
				{
					"score": 45,
					"author": "spiders138",
					"created_utc": 1559784225,
					"edited": false,
					"gildings": {},
					"body_html": "<p>We weren't even allowed to have water in school. I'm amazed at how lax the rules were at some of the schools in this thread.</p>",
					"id": "eq4rvn5",
					"replies": []
				}
			]
		},
		{
			"score": 422,
			"author": "justazag",
			"created_utc": 1559769707,
			"edited": false,
			"gildings": {},
			"body_html": "<p>No Selling things out of your locker.</p>\n<p>Ran quite the business back in Jr. High. Pens, pencils, sticky notes, Pokemon Cards, Random Toys like Beyblade Pats, special milk straws that had the flavor in the straws so whatever you were drinking changed flavor, and a few other random things I'd find or people would trade me for things instead of using money. Made maybe around $300.</p>\n<p>I wish they had just let me do what I was doing, my work was honest, after I got shut down all the kids selling things went underground. Now instead of instant-Chocolate milk straws the kids were buying weed from the quite kid in the bathroom.</p>",
			"id": "eq45lee",
			"replies": []
		},
		{
			"score": 136,
			"author": "Thevoiceofreason420",
			"created_utc": 1559770847,
			"edited": false,
			"gildings": {},
			"body_html": "<p>When I worked at Whole Foods in the prepared foods section I use to make myself a burrito for dinner. I would load that fucker as full with beans, rice, and meat as possible I usually ended up with something that was about the size of a fat baby's arm. Yeah that all came to a stop when one of the store managers saw me making my own burrito. After that we would get written up if they caught us making our own food like burritos and what not.</p>",
			"id": "eq47f0s",
			"replies": []
		},
		{
			"score": 292,
			"author": "bad_luck_dragon",
			"created_utc": 1559765131,
			"edited": false,
			"gildings": {},
			"body_html": "<p>Oh, I'm the reason for several safety rules at a local warehouse.&nbsp;</p>\n<p>We switched from heavy, grease covered king pin locks for trailers after I dropped one of the king pin locks on my head.&nbsp;</p>\n<p>Rain boots are required when dealing with trailers after I developed trench foot after working in the rain for 4 days straight in water logged shoes.&nbsp;</p>\n<p>Nothing heavier than 50lbs on the conveyer belt after I hurt my back trying to lift an 80lb box off a line 20' up.&nbsp;</p>\n<p>Everyone in the shipping department rotates through the fastest line after me and someone who was under got into a verbal fight over it.&nbsp;</p>\n<p>No one straight out said it, but I'm fairly certain the attendance policy got changed 3 times because of me.</p>",
			"id": "eq3xuot",
			"replies": []
		}
	],
	"options": {
		"song": "NORMAL-POIGNANT-sincerely-by-kevin-macleod.mp3",
		"theme": "thinkingstories"
	}
}