{"questionData":{"score":397,"author":"omgwhatshouldido","created_utc":1568622172,"num_comments":55,"all_awardings":[],"title":"From Wife to Protitute","id":"d4xqpy","nsfw":false,"flair":{"text":null,"bgColor":""},"archived":false,"selftext_html":"<p>Hello all, I want to start with a disclaimer: English is my 3rd language so apologies for any typos</p>\n<p>I do not know whether this fits into prorevenge but let's start anyway.</p>\n<p>When I was a student I met my future wife. Shortly after graduation we married. Everything was fine, we have had a happy life, two beautiful daughters and me as an Diplome engineer in the country of engineers (Germany) had a very decent income. When I got a promotion and was in charge of the business in 13 countries (we even moved to another country for the doubled income) , my wife started to act weirder. She started to spend money as hell,became more and more aggressive, violent and abusive. She started to hit and kick me when she was unhappy. It would have been a classic case of domestic violence if I wasn't a large and heavy man and she a small and light woman (authorities didn't care, police just laughed hard) . She even attacked me with a kitchen knive. &nbsp;But that was not even the worst....(police still laughing)&nbsp;</p>\n<p>I relalised that when I wasn't at home, she did the same to our daughters (both below 6 years old). When I was on business trip she left the house and did not come back for days, leaving the kids alone. She just made sure that she was at home before I came back from the business trips to clean up the mess.</p>\n<p>When I came back from the business trip early I found my kids in their own mess, completely disturbed and crying from hunger. I was furious. Immediately I spoke to my wife. She just replied that no one would believe me since she was small and cute.... And she was right... Not even the youth protection agencies (I hope they are called like that iin English) cared. She knew she could continue abusing my kids and me. She knew, if I get a divorce she would get the kids and I have to pay for her and the kids for the rest of my life and said that straight to my face. So I started to film and foto everything I could. To gather even more information, I offered her to get a joint calendar app were we both add our appointments. Clever as she is, she really entered all of her appointments, all of her tinder dates, all of her orgys and all of her customers appointments in the calendar. I played the role of the faithful submissive husband who is too stupid to realize what's going on.. With my lawyer and a recommended detective, we started to track her down and made Fotos. Then the luck came back to me. Her father was sick so my wife went to visit him (she was not from Europe). To do that, I suggested to take my girls temporarily to my parents in Germany (they were informed) on which she agreed. Together with another lawyer we set up some document, necessary to sign up the children in school but with some subtle changes she did not notice. She and I signed it immediately, giving up all custody of the girls to my parents. In addition we gathered enough information at that time to go to the court. &nbsp;We pressed charges on child abuse, child neclection, child endangerment (some of the orgys happened in our house while the kids were watching TV), domestic violence.</p>\n<p>My wife came back and thought she was smart and defended herself instead getting a lawyer herself. She did not realize what tsunami rolled towards her. When she realized, we offered to drop all charges when she signs a contract on OUR condition! I get the children, I do not owe her anything, she is not allowed to see the children unattended (a complete restraint order is not possible here (is that the right term?)), no holidays with the children and she has to pay alimonys.</p>\n<p>In the meantime I found a new job in Germany and moved back (even this was a heavy hit in my career).</p>\n<p>My now ex wife does not have any European Citizenship even living here for 10years+. By signing our divorce papers on our condition, she lost her residence permission for Germany and the country we lived in for a couple of years. She got the permission to stay a little bit longer to search for work and re-apply for a residence permission which she did. But as abusive as she was in the relationship, she was not able to adjust herself to a working environment. She got fired multiple times until the authorities lost their patience and canceled her welfare status. Now she has to pay alimonies, is about to lose her residence permission for Europe and is burned for any regular job. &nbsp;... &nbsp;... &nbsp;&nbsp;Yesterday I learned, she is a registered prostitute (in her current residence country you must be registered) with her own webpage were you can order her to the hotel (clever as she is, with her private telephone number and picture of herself with fully visible face). The good thing for her, she got a full 4.7 star rating and as far as I can juge from the orgy videos she is quite skillful.</p>\n<p>P.s. Even all this happened, I will never tell my daughters anything on their mothers fate, nor will I talk bad about her in front of the children.</p>","subreddit":"ProRevenge","includeSelftext":true},"commentData":[{"score":1,"author":"AutoModerator","created_utc":1568622172,"edited":false,"body_html":"<p>Welcome to ProRevenge! &nbsp;Unfortunately, your story has been removed because your account is very new. &nbsp;While we support the use of throwaway accounts, we have gotten a LOT of low quality stories from very new accounts of late. &nbsp;Thus all posting accounts must be at least 10 days old with at least 50 combined karma. &nbsp;&nbsp;</p>\n<p><em>I am a bot, and this action was performed automatically. Please </em><a href=\"/message/compose/?to=/r/ProRevenge\"><em>contact the moderators of this subreddit</em></a><em> if you have any questions or concerns.</em></p>","body":"Welcome to ProRevenge!  Unfortunately, your story has been removed because your account is very new.  While we support the use of throwaway accounts, we have gotten a LOT of low quality stories from very new accounts of late.  Thus all posting accounts must be at least 10 days old with at least 50 combined karma.   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ProRevenge) if you have any questions or concerns.*","id":"f0hhqwu","all_awardings":[],"replies":[]},{"score":92,"author":"omgwhatshouldido","created_utc":1568716613,"edited":false,"body_html":"<p>My girls are doing well. Their Grandparents are doing a great job when I am at work and the psychologists are very helpful too</p>","body":"My girls are doing well. Their Grandparents are doing a great job when I am at work and the psychologists are very helpful too","id":"f0lg9pp","all_awardings":[],"replies":[{"score":16,"author":"redditor_32","created_utc":1568805085,"edited":false,"body_html":"<p>Good to hear you got a psychologist involved. As a father I can completely feel you and I wish you all the best with your daughters.&nbsp;</p>\n<p>​</p>\n<p>Do you know if your wife was a prostitute before you married or did she start it after your marriage?</p>","body":"Good to hear you got a psychologist involved. As a father I can completely feel you and I wish you all the best with your daughters. \n\n&#x200B;\n\nDo you know if your wife was a prostitute before you married or did she start it after your marriage?","id":"f0ob7d9","all_awardings":[],"replies":[]}]},{"score":24,"author":"villagecynic","created_utc":1568690066,"edited":false,"body_html":"<p>How are your daughters? Have they been coping well since everything that had transpired?</p>","body":"How are your daughters? Have they been coping well since everything that had transpired?","id":"f0kwjiq","all_awardings":[],"replies":""},{"score":25,"author":"manymoreways","created_utc":1568773900,"edited":false,"body_html":"<p>OP just casually mentioned the obsessive cheating and orgies like it wasn't even part of his concern.</p>","body":"OP just casually mentioned the obsessive cheating and orgies like it wasn't even part of his concern.","id":"f0nmbdo","all_awardings":[],"replies":[]},{"score":14,"author":"atay_na3na3","created_utc":1568717047,"edited":false,"body_html":"<p>I do respect your decisions because you had the chance to screw her even more but still was very lenient on her. You will be a great dad and i'm sure your daughters will understand everything in the future.</p>\n<p>Keep up the great work. Much support from here &lt;3</p>","body":"I do respect your decisions because you had the chance to screw her even more but still was very lenient on her. You will be a great dad and i'm sure your daughters will understand everything in the future.\n\nKeep up the great work. Much support from here <3","id":"f0lgl3q","all_awardings":[],"replies":""},{"score":14,"author":"timleykis","created_utc":1568843515,"edited":false,"body_html":"<p>It's sad when the authorities just ignore domestic and child abuse when its a woman who is doing it.</p>","body":"It's sad when the authorities just ignore domestic and child abuse when its a woman who is doing it.","id":"f0pqp6b","all_awardings":[],"replies":[{"score":6,"author":"kermy_the_frog_here","created_utc":1568861136,"edited":false,"body_html":"<p>It’s a major double standard</p>","body":"It’s a major double standard","id":"f0qjyqy","all_awardings":[],"replies":""}]},{"score":6,"author":"Naan97","created_utc":1568735112,"edited":false,"body_html":"<p>Your English is great. I’m glad everything worked out for you and your kids</p>","body":"Your English is great. I’m glad everything worked out for you and your kids","id":"f0m2a5a","all_awardings":[],"replies":""}],"options":{"theme":"5d7fd596ad50ee40796a8125","song":null}}